parameters = {
    'Сангвінічний тип темпераменту':
        {
            True: [(1, 1), (6, 1), (12, 1), (16, 1), (20, 1)],
            False: []
        },

    'Холеричний тип темпераменту':
        {
            True: [(3, 1), (5, 1), (7, 1), (13, 1), (17, 1)],
            False: []
        },

    'Меланхолічний тип темпераменту':
        {
            True: [(2, 1), (9, 1), (10, 1), (14, 1), (19, 1)],
            False: []
        },

    'Флегматичний тип темпераменту':
        {
            True: [(4, 1), (8, 1), (11, 1), (15, 1), (18, 1)],
            False: []
        },

}
