parameters = {
    'Переживання психотравмуючих обставин':
        {
            True: [(1, 2), (13, 3), (25, 2), (49, 10), (61, 5)],
            False: [(37, 3), (73, 5)]
        },

    'Незадоволеність собою':
        {
            True: [(14, 2), (26, 2), (62, 5), (74, 3)],
            False: [(2, 3), (38, 10), (50, 5)]
        },

    'Загнаність у кут':
        {
            True: [(3, 10), (15, 5), (27, 2), (39, 2), (51, 5), (63, 1)],
            False: [(75, 5)]
        },

    'Тривога і депресія': {
        True: [(4, 2), (16, 3), (28, 5), (40, 5), (52, 10), (64, 2), (76, 3)],
        False: []
    },

    'Неадекватне вибіркове емоційне реагування':
        {
            True: [(5, 5), (29, 10), (41, 2), (53, 2), (65, 3), (77, 5)],
            False: [(17, 3)]
        },

    'Емоційно-моральна дезорієнтація':
        {
            True: [(6, 10), (30, 3), (42, 5), (54, 2), (66, 2)],
            False: [(18, 3), (78, 5)]
        },

    'Розширення сфери економії емоцій':
        {
            True: [(7, 2), (19, 10), (43, 5), (55, 3), (67, 3)],
            False: [(31, 2), (79, 5)]
        },

    "Редукція професійних обов'язків":
        {
            True: [(8, 5), (20, 5), (32, 2), (56, 3), (68, 3), (80, 10)],
            False: [(44, 2)]
        },

    'Емоційний дефіцит':
        {
            True: [(9, 3), (21, 2), (33, 5), (57, 3), (81, 2)],
            False: [(45, 5), (69, 10)]
        },

    'Емоційне відчуження':
        {
            True: [(10, 2), (22, 3), (46, 3), (58, 5), (70, 5), (82, 10)],
            False: [(34, 2)]
        },

    'Особистісне відчуження (деперсоналізація)':
        {
            True: [(11, 5), (23, 3), (35, 3), (47, 5), (59, 5), (71, 2), (83, 10)],
            False: []
        },

    'Психосоматичні та психовегетативні порушення':
        {
            True: [(12, 3), (24, 2), (36, 5), (48, 3), (60, 2), (72, 10), (84, 5)],
            False: []
        },
}

group_level_1 = {
    'Фаза "Напруження"': (
        "Переживання психотравмуючих обставин",
        "Незадоволеність собою",
        "Загнаність у кут",
        "Тривога і депресія",
    ),

    'Фаза "Резистенція"': (
        "Неадекватне вибіркове емоційне реагування",
        "Емоційно-моральна дезорієнтація",
        "Розширення сфери економії емоцій",
        "Редукція професійних обов'язків",
    ),

    'Фаза "Виснаження"': (
        "Емоційний дефіцит",
        "Емоційне відчуження",
        "Особистісне відчуження (деперсоналізація)",
        "Психосоматичні та психовегетативні порушення",
    ),
}
