import re
from typing import Dict, Tuple


def calculate_param(points: str, response: Dict[int, bool]):
    groups = re.findall(r"([+,-])(\d+)\((\d+)\)", points)
    return sum([
        int(group[2]) if response[int(group[1])] == (group[0] == "+") else 0 for group in groups
    ])


def calculate_params(response: Dict[int, bool]):
    return {key: calculate_param(value, response) for key, value in parameters.items()}


def connect_to_upper_group(processed_group, group, params):
    result = {}
    for group_key, group_value in group.items():
        sub = {el: (params[el],) for el in group_value}
        result[group_key] = (processed_group[group_key], sub)
    return result


parameters = {
    "Переживання психотравмуючих обставин":
        "+1(2), +13(3), +25(2), -37(3), +49(10), +61(5), -73(5)",

    "Незадоволеність собою":
        "-2(3), +14(2), +26(2), -38(10), -50(5), +62(5), +74(3)",

    "Загнаність у кут":
        "+3(10), +15(5), +27(2), +39(2),+51(5), +63(1), -75(5)",

    "Тривога і депресія":
        "+4(2), +16(3), +28(5), +40(5), +52(10), +64(2), +76(3)",

    "Неадекватне вибіркове емоційне реагування":
        "+5(5), -17(3), +29(10), +41(2), +53(2), +65(3), +77(5)",

    "Емоційно-моральна дезорієнтація":
        "+6(10), -18(3), +30(3), +42(5), +54(2), +66(2), -78(5)",

    "Розширення сфери економії емоцій":
        "+7(2), +19(10), -31(2), +43(5), +55(3), +67(3), -79(5)",

    "Редукція професійних обов'язків":
        "+8(5), +20(5), +32(2), -44(2), +56(3), +68(3), +80(10)",

    "Емоційний дефіцит":
        "+9(3), +21(2), +33(5), -45(5), +57(3), -69(10), +81(2)",

    "Емоційне відчуження":
        "+10(2), +22(3), -34(2), +46(3), +58(5), +70(5), +82(10)",

    "Особистісне відчуження (деперсоналізація)":
        "+11(5), +23(3), +35(3), +47(5), +59(5), +71(2), +83(10)",

    "Психосоматичні та психовегетативні порушення":
        "+12(3), +24(2), +36(5), +48(3), +60(2), +72(10), +84(5)",
}

group_level_1 = {
    'Фаза "Напруження"': (
        "Переживання психотравмуючих обставин",
        "Незадоволеність собою",
        "Загнаність у кут",
        "Тривога і депресія",
    ),

    'Фаза "Резистенція"': (
        "Неадекватне вибіркове емоційне реагування",
        "Емоційно-моральна дезорієнтація",
        "Розширення сфери економії емоцій",
        "Редукція професійних обов'язків",
    ),

    'Фаза "Виснаження"': (
        "Емоційний дефіцит",
        "Емоційне відчуження",
        "Особистісне відчуження (деперсоналізація)",
        "Психосоматичні та психовегетативні порушення",
    ),
}
