import re
from typing import Dict, Tuple


def points_sum(points: str, response: Dict[int, bool]):
    groups = re.findall(r"([+,-])(\d+)\((\d+)\)", points)
    return sum([
        int(group[2]) if response[int(group[1])] == (group[0] == "+") else 0 for group in groups
    ])


def calculate_symptoms(response: Dict[int, bool]):
    return {key: points_sum(value, response) for key, value in symptoms.items()}


symptoms = {
    "Переживання психотравмуючих обставин":
        "+1(2), +13(3), +25(2), -37(3), +49(10), +61(5), -73(5)",

    "Незадоволеність собою":
        "-2(3), +14(2), +26(2), -38(10), -50(5), +62(5), +74(3)",

    "Загнаність у кут":
        "+3(10), +15(5), +27(2), +39(2),+51(5), +63(1), -75(5)",

    "Тривога і депресія":
        "+4(2), +16(3), +28(5), +40(5), +52(10), +64(2), +76(3)",

    "Неадекватне вибіркове емоційне реагування":
        "+5(5), -17(3), +29(10), +41(2), +53(2), +65(3), +77(5)",

    "Емоційно-моральна дезорієнтація":
        "+6(10), -18(3), +30(3), +42(5), +54(2), +66(2), -78(5)",

    "Розширення сфери економії емоцій":
        "+7(2), +19(10), -31(2), +43(5), +55(3), +67(3), -79(5)",

    "Редукція професійних обов'язків":
        "+8(5), +20(5), +32(2), -44(2), +56(3), +68(3), +80(10)",

    "Емоційний дефіцит":
        "+9(3), +21(2), +33(5), -45(5), +57(3), -69(10), +81(2)",

    "Емоційне відчуження":
        "+10(2), +22(3), -34(2), +46(3), +58(5), +70(5), +82(10)",

    "Особистісне відчуження (деперсоналізація)":
        "+11(5), +23(3), +35(3), +47(5), +59(5), +71(2), +83(10)",

    "Психосоматичні та психовегетативні порушення":
        "+12(3), +24(2), +36(5), +48(3), +60(2), +72(10), +84(5)",
}

raw_phases = {
    'Фаза "Напруження"': (
        "Переживання психотравмуючих обставин",
        "Незадоволеність собою",
        "Загнаність у кут",
        "Тривога і депресія",
    ),

    'Фаза "Резистенція"': (
        "Неадекватне вибіркове емоційне реагування",
        "Емоційно-моральна дезорієнтація",
        "Розширення сфери економії емоцій",
        "Редукція професійних обов'язків",
    ),

    'Фаза "Виснаження"': (
        "Емоційний дефіцит",
        "Емоційне відчуження",
        "Особистісне відчуження (деперсоналізація)",
        "Психосоматичні та психовегетативні порушення",
    ),
}


processing_info = """
Запропонована методика дає детальну картину синдрому «емоційного вигорання». Насамперед, необхідно звернути увагу на окремі симптоми. Показник вира-жсиості кожного симптому знаходиться в межах від 0 до ЗО балів:
<br><br>
0-9 балів — симптом не сформований;
<br>
10-15 балів — симптом на стадії формування;
<br>
16 і більше балів — симптом сформований.
<br><br>
Симптоми з показниками 20 і більше балів є домінуючими у фазі або у всьому синдромі «емоційного вигорання».
<br><br>
Методика дає можливість побачити провідні симптоми «вигорання». Суттєвим є те, до якої фази формування «емоційного вигорання» належать домінуючі симптоми і в якій фазі їх найбільша кількість.
<br><br>
Наступний крок в інтерпретації результатів — осмислення показників фаз розвитку -«вигорання»: «напруження», «резистенція» та «виснаження».
<br><br>
У кожній з них оцінка можлива в межах від 0 до 120 балів. Однак співставлений балів, отриманих для фаз, не є правомірним, тому що не свідчить про їхню відносну роль або внесок у синдром. Справа в тому, що вимірювані в них явища істотно різі — реакція на зовнішні і внутрішні фактори, прийоми психологічного захисту, стан нервової системи. За кількісними показниками можна твердити тільки про те, наскільки кожна фаза сформувалася, яка фаза сформувалася більшою або меншою мірою:
<br><br>
• 36 і менше балів — фаза не сформована;
<br>
• 37—60 балів — фаза на стадії формування;
<br>
• 61 і більше балів — фаза сформована.
"""