import re
from typing import Dict, Tuple, List


def points_sum(points: Dict[bool, List[int]], response: Dict[int, bool]):
    plus = [1 for el in points[True] if response[el]]
    minus = [1 for el in points[False] if not response[el]]
    return len(plus) + len(minus)


def calculate_parameters(response: Dict[int, bool]):
    return {key: points_sum(value, response) for key, value in parameters.items()}


parameters = {
    "Ергічність (Ер)":
        {
            True: [4, 6, 15, 22, 42, 50, 58, 64, 98],
            False: [27, 83, 103],
        },

    "Соціальна ергічність (СЕр)":
        {
            True: [11, 30, 57, 62, 67, 78, 86],
            False: [3, 34, 74, 90, 105],
        },

    "Пластичність (П)":
        {
            True: [20, 25, 35, 38, 47, 66, 71, 76, 101],
            False: [54, 59],
        },

    "Соціальна пластичність (СП)":
        {
            True: [2, 9, 18, 26, 45, 68, 85, 99],
            False: [31, 81, 87, 93],
        },

    "Темп (Т)":
        {
            True: [1, 13, 19, 33, 46, 49, 55, 77],
            False: [29, 43, 70, 94],
        },

    "Соціальний темп (СТ)":
        {
            True: [24, 37, 39, 51, 72, 92],
            False: [5, 10, 16, 56, 96, 102],
        },

    "Емоційність (Ем)":
        {
            True: [14, 17, 28, 40, 60, 61, 79, 88, 91, 95, 97],
            False: [],
        },

    "Соціальна емоційність (СЕм)":
        {
            True: [6, 7, 21, 36, 41, 48, 53, 63, 75, 80, 84, 100],
            False: [],
        },

    "Контрольні запитання на соціальну бажаність (К)":
        {
            True: [32, 52, 89],
            False: [12, 23, 44, 65, 73, 82],
        },
}

raw_phases = {
    'Фаза "Напруження"': (
        "Переживання психотравмуючих обставин",
        "Незадоволеність собою",
        "Загнаність у кут",
        "Тривога і депресія",
    ),

    'Фаза "Резистенція"': (
        "Неадекватне вибіркове емоційне реагування",
        "Емоційно-моральна дезорієнтація",
        "Розширення сфери економії емоцій",
        "Редукція професійних обов'язків",
    ),

    'Фаза "Виснаження"': (
        "Емоційний дефіцит",
        "Емоційне відчуження",
        "Особистісне відчуження (деперсоналізація)",
        "Психосоматичні та психовегетативні порушення",
    ),
}

processing_info = """
Відповіді на даний тест-опитувальник надають можливість характеризувати темперамент як систему формальних змін у поведінці, які відображають 4-блокову структуру функціональної системи людини:
<br>
- блок аферентного синтезу, якому відповідає ергічність;
<br>
- блок програмування, який представлено пластичністю;
<br>
- блок виконань, якому відповідає темп;
<br>
- блок зворотного зв’язку, якому відповідає емоційна чутливість.
<br><br>
У кожній шкалі темпераменту виділено дві підшкали: предметно-орієнтована та суб’єктивно-орієнтована (комунікативна). Вони відображають дві сфери взаємозв’язку людини і навколишнього середовища: предметний світ і суспільство, тобто діяльність і спілкування.
<br><br>
Показник Ер – предметна ергічність. Включає в себе питання про рівень потреби в освоєнні предметного світу, прагненні до розумової та фізичної праці.
<br>
Високі значення за цією шкалою означають високу потребу в освоєнні предметного світу, спрагу діяльності, прагнення до напруженої розумової і фізичної праці, легкість розумового пробудження.
<br>
Низькі значення означають пасивність, низький рівень тонусу та активації, небажання розумової напруги низьку залученість в процесі діяльності.
<br><br>
Показник СЕр – соціальна ергічність. Містить питання про рівень потреби в соціальних контактах, про прагнення до лідерства.
<br>
Високі значення – комунікативна ергічність, потреба в соціальному контакті, бажання освоєння соціальних форм діяльності, прагнення до лідерства, товариськість, прагнення до заняття високого рангу, освоєння світу через комунікацію.
<br>
Низькі значення – незначна потреба в соціальних контактах, відхід від соціально-активних форм поведінки, замкнутість, соціальна пасивність.
<br><br>
Показник П – пластичність. Містить питання про ступінь легкості або труднощі переключення з одного предмета на інший, швидкість переходу з одних способів мислення на інші.
<br>
Високі значення – легкість перемикання з одного виду діяльності на інший, швидкий перехід із одних форм мислення на інші в процесі взаємодії з предметним середовищем, прагнення до різноманітності форм предметної діяльності.
<br>
Низькі значення – схильність до монотонної роботи, боязнь й уникнення різноманітних форм поведінки, в’язкість, консервативні форми діяльності.
<br><br>
Показник СП – соціальна пластичність. Містить питання, спрямовані на з’ясування ступеня легкості або труднощі перемикання в процесі спілкування від однієї людини до іншої, схильності до різноманітності комунікативних програм.
<br>
Високі значення – широкий набір комунікативних програм, автоматичне включення в соціальні зв’язки, легкість вступу в соціальні контакти, легкість перемикання в процесі спілкування, наявність великої кількості комунікативних заготовок, комунікативна імпульсивність.
<br>
Низькі значення - труднощі в підборі форм соціальної взаємодії, низький рівень готовності до вступу в соціальні контакти, прагнення до підтримання монотонних контактів.
<br><br>
Показник Т – темп. Включає питання про швидкість моторно-рухових актів при виконанні предметної діяльності.
<br>
Високі значення – високий темп поведінки, висока швидкість виконання операцій при здійсненні предметної діяльності, моторно-рухова швидкість, висока психічна швидкість при виконанні конкретних завдань.
<br>
Низькі значення – уповільненість дій, низька швидкість моторно- рухових операцій.
<br><br>
Показник СТ – соціальний темп. Включає питання, спрямовані на виявлення швидкісних характеристик мовнорухливих актів у процесі спілкування.
<br>Високі значення – мовнорухлива швидкість, швидкість говоріння, високі швидкості і можливості мовленнєвого апарату.
<br>Низькі значення – слабо розвинена мовнорухлива система, мовна повільність, повільна вербалізація.
<br><br>Показник Ем – емоційність. Включає в себе питання, що оцінюють емоційність, чутливість, чутливість до невдачі в роботі.
<br>Високі значення – висока чутливість до розбіжності між задуманим і очікуваним, планованим і результатами реальної дії, відчуття невпевненості, тривоги, неповноцінності, високе занепокоєння з приводу роботи, чутливість до невдач, до розбіжності між задуманим, очікуваним, запланованим і результатами реальної дії.
<br>Низькі значення – незначне емоційне реагування при невдачах, нечутливість до неуспіху справи, спокій, впевненість у собі.
<br><br>Показник СЕм – соціальна емоційність. Включає питання, що стосуються емоційної чутливості в комунікативній сфері.
<br>Високі значення – висока емоційність у комунікативній сфері, висока чутливість до невдач у спілкуванні.
<br>Низькі значення – низька емоційність у комунікативній сфері, нечутливість до оцінок товаришів, відсутність чутливості до невдач у спілкуванні, впевненість у собі та ситуаціях спілкування.
<br><br>Показник контролю соціальної бажаності К – це показник щирості відповідей. Відповіді, які збігаються, характеризують ступінь викривлення тим, хто відповідає, інформації про себе. Чим більший показник, тим менше щирості, та чим він менший, тим більш достовірними є інші показники темпераменту. Вважається, що відповідаючий був щирим і чесним із собою, якщо К не перевищує 5.
<br>Рівень кожної властивості досліджуваного темпераменту оцінюється окремо. При цьому якщо той чи інший показник має величину в межах 0-3, то це говорить про низький рівень, якщо 4-8 – про середній, якщо 9-12 – про високий.
<br><br>Висновок про домінуючий тип темпераменту особистості робиться на основі порівняння показників, отриманих із різних властивостей темпераменту, з відповідними типами темпераменту.
<br>Сангвінік – середньорозвинений показник за всіма властивостями темпераменту.
<br>Холерик – високі показники по енергійності, темпу й емоційності при середніх або високих показниках по пластичності.
<br>Флегматик – низькі показники за всіма властивостями темпераменту.
<br>Меланхолік – низькі показники по енергійності, пластичності, темпу при середніх або високих показниках по емоційності.
"""
